# ElectricalAnalyticalLoadSet Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalAnalyticalLoadSet Class
Members See Also
---
Represents the electrical analytical load set, it can contain a set of Electrical Analytical Equipment Loads.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public class ElectricalAnalyticalLoadSet : Element
```

Visual Basic
---
```text
Public Class ElectricalAnalyticalLoadSet _
	Inherits Element
```

Visual C++
---
```text
public ref class ElectricalAnalyticalLoadSet : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Electrical..::..ElectricalAnalyticalLoadSet
# See Also
ElectricalAnalyticalLoadSet Members
Autodesk.Revit.DB.Electrical Namespace